[
  {
    "Current date": "11/14",
    "Fact": "On this date in 1962, Eritrea was made a province of the Ethiopian Empire",
    "Location": "9.005401, 38.763611"
  },
  {
    "Current date": "11/15",
    "Fact": "On this date in 1988, Yasser Arafat issued a Declaration of Independence for the Palestinian state.",
    "Location": "31.527321, 34.592941"
  },
  {
    "Current date": "11/16",
    "Fact": "On this date in 1988, Benazir Bhutto was elected as the first woman in modern history to lead a Muslim country as the PM of Pakistan",
    "Location": "33.738045, 73.084488"
  },
  {
    "Current date": "11/17",
    "Fact": "On this date in 1973, Richard Nixon declared “I am not a crook”.",
    "Location": "38.889805, -77.009056"
  },
  {
    "Current date": "11/18",
    "Fact": "On this date in 1978, Jim Jones his followers died in the Jonestown massacre.",
    "Location": "7.689444, -59.95"
  },
  {
    "Current date": "11/19",
    "Fact": "On this date in 2017, cult leader Charles Manson died in prison in Bakersfield, CA.",
    "Location": "35.393528, -119.043732"
  },
  {
    "Current date": "11/20",
    "Fact": "On this date in 1910, Leo Tolstoy died of heart failure at the railroad station of Astapovo.",
    "Location": "51.676212, 39.210442"
  },
  {
    "Current date": "11/21",
    "Fact": "On this date in 1920, Stan Musial, legendary first baseman for the St. Louis Cardinals, was born.",
    "Location": "40.175833, -79.861389"
  },
  {
    "Current date": "11/22",
    "Fact": "On this date in 1963, JFK was assassinated in Dallas, TX",
    "Location": "32.779167, -96.808891"
  },
  {
    "Current date": "11/23",
    "Fact": "On this date in 1990, famed author Roald Dahl died in Oxford, England",
    "Location": "51.752022, -1.257677"
  },
  {
    "Current date": "11/24",
    "Fact": "On this date in 2001, Turkey ratified changes to their legal code and made women equal to men under the law.",
    "Location": "39.925533, 32.866287"
  },
  {
    "Current date": "11/25",
    "Fact": "On this date in 2020, Diego Maradona died at age 60 in Dique Luján, Argentina",
    "Location": "-34.383333, -58.7"
  },
  {
    "Current date": "11/26",
    "Fact": "On this date in 2008, ten gunmen in Mumbai launched a series of attacks, killing 174 people over three days.",
    "Location": "19.076111, 72.8775"
  },
  {
    "Current date": "11/27",
    "Fact": "On this date in 1924, the first “Macy’s Thanksgiving Day Parade” was held in NYC, NY.",
    "Location": "40.712778, -74.006111"
  },
  {
    "Current date": "11/28",
    "Fact": "On this date in 2012, Peter Jackson’s “The Hobbit: An Unexpected Journey” premiered in New Zealand.",
    "Location": "-41.288889, 174.777222"
  },
  {
    "Current date": "11/29",
    "Fact": "On this date in 1947, the UN approves of the partition of Palestine which introduced the state of Israel.",
    "Location": "31.778889, 35.225556"
  },
  {
    "Current date": "11/30",
    "Fact": "On this date in 2007, daredevil “Evel Knievel” died at 69 in Clearwater, FL.",
    "Location": "27.973611, -82.764167"
  },
  {
    "Current date": "12/1",
    "Fact": "On this date in 1955, Rosa Parks refused to surrender her bus seat sparking a civil rights, bus boycott.",
    "Location": "32.3675, -86.3"
  },
  {
    "Current date": "12/2",
    "Fact": "On this date in 1993, Pablo Escobar was killed in a shootout with authorities in Medellin, Colombia.",
    "Location": "6.230833, -75.590556"
  },
  {
    "Current date": "12/3",
    "Fact": "On this date in 1984, there was a major gas leak in Bhopal, India.",
    "Location": "23.259889, 77.412611"
  },
  {
    "Current date": "12/4",
    "Fact": "On this date in 1970, Shawn Corey Carter was born in Brooklyn, NY. He is better known as Jay-Z.",
    "Location": "40.692778, -73.990278"
  },
  {
    "Current date": "12/5",
    "Fact": "On this date in 2013, Nelson Mandela died at 95.",
    "Location": "-26.204444, 28.045556"
  },
  {
    "Current date": "12/6",
    "Fact": "On this date in 1973, Gerald Ford was sworn in as VP after Spiro Agnew resigned.",
    "Location": "38.889805, -77.009056"
  },
  {
    "Current date": "12/7",
    "Fact": "On this date in 1941, Pearl Harbor was attacked by Japanese bombers in Hawaii.",
    "Location": "21.306944, -157.858333"
  },
  {
    "Current date": "12/8",
    "Fact": "On this date in 1980, John Lennon was assassinated by a crazed fan in New York City, NY.",
    "Location": "40.712778, -74.006111"
  },
  {
    "Current date": "12/9",
    "Fact": "On this date in 1869, the first ever traffic light was raised near Westminster Bridge in London.",
    "Location": "51.5, -0.133333"
  },
  {
    "Current date": "12/10",
    "Fact": "On this date in 2005, Richard Pryor died at 65 in LA, CA",
    "Location": "34.05, -118.25"
  },
  {
    "Current date": "12/11",
    "Fact": "On this date in 1988, the U.S. House of Representatives recommended three articles of impeachment against Bill Clinton for the Monica Lewinsky affairs.",
    "Location": "38.889805, -77.009056"
  },
  {
    "Current date": "12/12",
    "Fact": "On this date in 1964, Kenya became a republic.",
    "Location": "-1.286389, 36.817222"
  },
  {
    "Current date": "12/13",
    "Fact": "On this date in 1989, Taylor Swift was born. 14 years later, Saddam Hussein was captured by U.S. forces during the Iraq war.",
    "Location": "40.334167, -75.946667"
  },
  {
    "Current date": "12/14",
    "Fact": "On this date in 1799, George Washington died at 67.",
    "Location": "38.708, -77.0861"
  },
  {
    "Current date": "12/15",
    "Fact": "On this date in 2010, the Leaning Tower of Pisa was reopened in Pisa, Italy.",
    "Location": "43.716667, 10.4"
  },
  {
    "Current date": "12/16",
    "Fact": "On this date in 1773, American colonists threw 342 chests of tea into the Boston Harbor, later to be called the Boston Tea Party.",
    "Location": "42.360278, -71.057778"
  },
  {
    "Current date": "12/17",
    "Fact": "On this date in 2011, North Korean leader Kim Jong Il died and was succeeded by current leader Kim Jong Un.",
    "Location": "39.016667, 125.7475"
  },
  {
    "Current date": "12/18",
    "Fact": "On this date in 1865, slavery was abolished in the United States by the 13th amendment.",
    "Location": "38.889805, -77.009056"
  },
  {
    "Current date": "12/19",
    "Fact": "On this date in 1988, Bill Clinton was impeached by the U.S. House of Representatives.",
    "Location": "38.889805, -77.009056"
  },
  {
    "Current date": "12/20",
    "Fact": "On this date in 1989, the United States launched Operation Just Cause, a military invasion of Panama",
    "Location": "8.983333, -79.516667"
  },
  {
    "Current date": "12/21",
    "Fact": "On this date in 1898, Marie Curie (and Pierre Curie) discovered Radium",
    "Location": "48.856667, 2.352222"
  }
]
